Public Attributes | List of all members
API_FileSavePars Struct Reference
Project Operations
Parameters to save the current project file. More...
#include <APIdefs_Automate.h>
 Public Attributes
 API_FTypeID  | fileTypeID
The output format.
 IO::Location *  | file
The specification of the target file.
Detailed Description
Parameters to save the current project file.
Remarks
: To utilize this structure, see the ACAPI_ProjectOperation_Save automation function.